---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.Kilonewtons
source: html/c39c85ca-6ea0-e0cc-dcfc-f48aeb3a3f77.htm
---
# Autodesk.Revit.DB.UnitTypeId.Kilonewtons Property

Kilonewtons.

## Syntax (C#)
```csharp
public static ForgeTypeId Kilonewtons { get; }
```